In [2]:
import pandas as pd

In [9]:
friend_dict_list = [
    {'name': 'Jonh', 'age': 25, 'job': 'student'},
    {'name': 'Nate', 'age': 30, 'job': 'teacher'}
]

In [10]:
df=pd.DataFrame(friend_dict_list)

In [11]:
df.head()

   name  age      job
0  Jonh   25  student
1  Nate   30  teacher

In [12]:
df=df[['name','age','job']]

In [13]:
df.head()

   name  age      job
0  Jonh   25  student
1  Nate   30  teacher

In [14]:
from collections import OrderedDict

In [20]:
friend_ordered_dict=OrderedDict(
[
    ('name',['John','Nate']),
    ('age',[25,30]),
    ('job',['student','teacher'])
]
)

In [21]:
df=pd.DataFrame.from_dict(friend_ordered_dict)

In [22]:
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [24]:
friend_list=[
    ['John',25,'student'],
    ['Nate',30,'teacher']
]

In [25]:
column_name=['name','age','job']

In [26]:
df=pd.DataFrame.from_records(friend_list,columns=column_name)

In [27]:
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [28]:
friend_list=[
    ['name',['John','Nate']],
    ['age',[25,30]],
    ['job',['teacher','student']]
]

In [29]:
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [1]:
df = pd.DataFrame.from_items(friend_list)

NameError: name 'pd' is not defined

In [32]:
df

   name  age      job
0  John   25  student
1  Nate   30  teacher